{
  "signs":
  [
    {
      "zodiacNumber":1,
      "zodiacName":"aries",
      "start": {
        "date": 21,
        "monthNumber": 3,
        "monthName":"march"
      },
      "end": {
        "date": 19,
        "monthNumber": 4,
        "monthName":"april"
      }
    },

    {
      "zodiacNumber":2,
      "zodiacName":"taurus",
      "start": {
        "date": 20,
        "monthNumber": 4,
        "monthName":"april"
      },
      "end": {
        "date": 20,
        "monthNumber": 5,
        "monthName":"may"
      }
    },

    {
      "zodiacNumber":3,
      "zodiacName":"gemini",
      "start": {
        "date": 21,
        "monthNumber": 5,
        "monthName":"may"
      },
      "end": {
        "date": 20,
        "monthNumber": 6,
        "monthName":"june"
      }
    },

    {
      "zodiacNumber":4,
      "zodiacName":"cancer",
      "start": {
        "date": 21,
        "monthNumber": 6,
        "monthName":"june"
      },
      "end": {
        "date": 22,
        "monthNumber": 7,
        "monthName":"july"
      }
    },

    {
      "zodiacNumber":5,
      "zodiacName":"leo",
      "start": {
        "date": 23,
        "monthNumber": 7,
        "monthName":"july"
      },
      "end": {
        "date": 22,
        "monthNumber": 8,
        "monthName":"august"
      }
    },

    {
      "zodiacNumber":6,
      "zodiacName":"virgo",
      "start": {
        "date": 23,
        "monthNumber": 8,
        "monthName":"august"
      },
      "end": {
        "date": 22,
        "monthNumber": 9,
        "monthName":"september"
      }
    },

    {
      "zodiacNumber":7,
      "zodiacName":"libra",
      "start": {
        "date": 23,
        "monthNumber": 9,
        "monthName":"september"
      },
      "end": {
        "date": 22,
        "monthNumber": 10,
        "monthName":"october"
      }
    },

    {
      "zodiacNumber":8,
      "zodiacName":"scorpio",
      "start": {
        "date": 23,
        "monthNumber": 10,
        "monthName":"october"
      },
      "end": {
        "date": 21,
        "monthNumber": 11,
        "monthName":"november"
      }
    },

    {
      "zodiacNumber":9,
      "zodiacName":"sagittarius",
      "start": {
        "date": 22,
        "monthNumber": 11,
        "monthName":"november"
      },
      "end": {
        "date": 21,
        "monthNumber": 12,
        "monthName":"december"
      }
    },

    {
      "zodiacNumber":10,
      "zodiacName":"capricorn",
      "start": {
        "date": 22,
        "monthNumber": 12,
        "monthName":"december"
      },
      "end": {
        "date": 19,
        "monthNumber": 1,
        "monthName":"january"
      }
    },

    {
      "zodiacNumber":11,
      "zodiacName":"aquarius",
      "start": {
        "date": 20,
        "monthNumber": 1,
        "monthName":"january"
      },
      "end": {
        "date": 18,
        "monthNumber": 2,
        "monthName":"february"
      }
    },

    {
      "zodiacNumber":12,
      "zodiacName":"pisces",
      "start": {
        "date": 19,
        "monthNumber": 2,
        "monthName":"february"
      },
      "end": {
        "date": 20,
        "monthNumber": 3,
        "monthName":"march"
      }
    }
  ],

  "descriptions" : [
    {
      "zodiacName":"aries",
      "zodiacNumber":1,
      "element":"Fire",
      "symbol":"The Ram",
      "description": "Aries are fire signs and those born under this element are regarded in astrology as adventurous, active and outgoing. It won't matter where you go or how remote or unusual it is - from the Outback to the Antarctic - you can be sure that an Aries has been there before you (or at the very least you will meet one along the way!) Aries is a uniquely naive sign. Although they are independent, outgoing and assertive they are also surprisingly trusting, often innocently walking into the lion's den at times. No matter what upheaval, challenge or triumph they confront - an Aries has a wonderful ability to bounce back. Their faith in life and the future remains untouched by hardship. Their gift is that they are always children at heart and the world is always a magical place for them. Many famous sports people are born under this sign. Aries is regarded as the most physical sign and because of its Mar's rulership; it is also one of the most highly charged masculine energy signs in astrology. No wonder women born under Aries are forceful, dynamic and aggressive, and as a result these Aries women frequently find themselves with dilemmas surrounding their romantic relationships. For them, a man has to be a 'real man' to deal with an Aries woman, otherwise she intimidates him. And conversely for the Aries male, a woman has to be a real woman to deal with him, because he is looking for many balancing component traits (his true feminine side) in his partner. She has to run the gamut in his support system, from the Aries man's best friend, true companion, through to his muse, and yet she must never ever answer him back! Therefore Aries can be a confusing sign because there is a complex combination of very strong masculine and feminine expressions all combined together. Because of the male energy surrounding it, when a woman is born under Aries, it creates some of the most interesting women in the world, women who are adventurous, independent and have competitive natures. It also tends to make them very forthright. But whether male or female, Aries people are 'doers' rather than 'talkers'. They are the impulsive, act first, ask questions or have doubts later, sign of the zodiac. That's why their lives are often filled with many dramas and sometimes even accidents! Their ability to live life close to the edge provides them with a wealth of 'real experience' to call upon. When an Aries person talks about something or somewhere they've usually done it or been there, rather than simply read about it in a book. Being active people Aries can't adapt to any kind of restriction, particularly possessive relationships. They often travel to escape any feelings of being stuck or possessed. Aries people love challenges. In fact, if everything is running smoothly, they are quite capable of going out and doing something (sometimes quite foolish) to rock the boat. Aries love to race in where angels fear to tread."
    },

    {
      "zodiacName":"taurus",
      "zodiacNumber":2,
      "element":"Earth",
      "symbol":"The Bull",
      "description": "Underneath their cool, calm and collected exterior, Taureans differ greatly from all the other signs of the zodiac. Taureans manage to discreetly stay apart from the crowd, even though they have a well-earned reputation for being socialisers. They will let others get close, but only so close as they want them. Some claim that trying to get your point across to a Taurean, should they not want to hear you, is rather similar to talking to the trees, they simply won't budge. And, there is no such thing as an open-book Taurean. Their feelings, fears and desires often run far deeper than anyone around them would guess. Like the butterfly that chooses to remain hidden in its cocoon until it is ready and prepared to emerge, so the true Taurean spirit remains hidden behind a veneer of day-to-day activities. That's why Taureans are sometimes regarded as snobby, withdrawn, boring, or even sulky. The truth is, when Taureans manage to operate very adequately on their own form of automatic pilot, they can switch off from the world around them very efficiently. And when they do switch off, they are actually gathering in their inner reserves to deal with the outside pressures. This sign is also very closely connected to 'feeling good'. Most Taureans like their creature comforts and hate change because it takes them out of their automatic pilot condition of separating themselves from the world around them. Because they hate to be put in jeopardy of any kind, this is the sign that strives to create tomorrow in advance, rather than leave it to fate. In love, Taureans are regarded as extremely sensual beings. An earth sign, they deal well with the personal, physical senses and consequently all the pleasures associated with what they can see, touch, smell and taste, add up to a special delight to them. Often nature and pet lovers, Taureans are closely associated with all things off the earth and nature."
    },

    {
      "zodiacName":"gemini",
      "zodiacNumber":3,
      "element":"Air",
      "symbol":"The Twins",
      "description": "In ancient Greek mythology, Gemini's ruler - Mercury, was the light-footed messenger of the gods who darted back and forth across the heavens delivering news - which might explain why those born under the sign of the 'Twins' are always on the move; thirsty for knowledge and new experiences. Terminally curious and sometimes even mischievous, Geminis are multi-faceted souls who enjoy knowing a little bit of everything but generally not too much about one particular subject. It's just that variety is the spice of their lives! In Astrology, Geminis have also gained the reputation of being the incessant talkers of the zodiac. Those Twins that don't have the 'gift of the gab' are usually talented writers or have a special interest in foreign languages. In love, they look for a partner who can keep up with them mentally and physically! And, to quote Oscar Wilde, 'there's one thing worse than people talking about you, that's people not talking about you.' Whether Geminis like it or not, people are usually 'talking about them'. Together with Scorpio and Virgos, they are a sign that is often discussed, dissected and sometimes even put down by the other signs of the zodiac. Sometimes this is a subtle form of jealousy by others, because Geminis do lead very unique and unusual lives. The Gemini personality can appear mysterious or detached to others and therefore they are often misunderstood and unappreciated for the talents they offer to the world at large. Another reason Geminis evoke so much interest is many born under this sign are multi-dimensionally talented. In money matters, some Geminis are very adept and quick at making it...and spending it too. Many Geminis are involved in international financial wheeling and dealing. They love the adventure and game playing involved in out-thinking other people. Gemini's can be very haphazard about their financial affairs too, with many of them ending up in divorce courts mainly because their partners have become tired of living on the edge of a financial precipice."
    },

    {
      "zodiacName":"cancer",
      "zodiacNumber":4,
      "element":"Water",
      "symbol":"The Crab",
      "description": "Those born under the sign of Cancer, ruled by the mysterious Moon, are one of the zodiac's enigmas. It is fair to say that most Cancers are a bundle of contradictions. Compassionate and caring with friends, family and lovers, yet they can cut to the bone with their jealous remarks and ever-changing moods. Endearingly eccentric on one hand, and on the other, insecure about how others see them. Like their astrological symbol - the Crab - Cancers can appear hard and insensitive on the outside. However, for those of us who know and love a 'Moon Child', we understand that deep below lies a softness and sensitivity that makes them so very special.. Just as the Moon goes through many changes as it moves from its new to full phases, Cancers too go through many new and full phases of experience. Life doesn't stand still for this sign, even if they remain in one place, because they live so much in their internal oceans of emotions. Their link with the Moon often makes it impossible for them to operate on an even keel from day to day. Up and down like the proverbial yo-yo, most Cancerians feel one way one minute, then sometimes totally different the next. But this characteristic is part of their charm. Love and romance matter more than anything else to this sign (but this occasionally shares first place with having lots of money in the bank). No other sign romances better, equally though, no sign takes it so badly when romance turns sour either. But with their changeable natures Cancerians are fascinating, mysterious, stimulating and extremely alluring. This sign is one of the most magic of all and once their magic has reached you, they are the most beguiling companions. After all, isn't the Moon the most talked about and romantic galactic identity"
    },

    {
      "zodiacName":"leo",
      "zodiacNumber":5,
      "element":"Fire",
      "symbol":"The Lion",
      "description": "Love triumphs over all for this sign, which is ruled by the heart and operates from this dimension too. Leo's are born fortunate. Charismatic and positive-thinking they attract not only an abundance of friends and opportunities, but manage to survive life's stormy times with style and good humour. Once a Lion is committed to a relationship, they are totally devoted and faithful. Should their heart or trust be broken they never forgive or forget. When a relationship breaks down (even a long standing one) they can disappear into the sunset without a backward look. Leos can cut ties, and leave others heartbroken, but usually there is a good reason why they have broken a trust. For a Leo, when a relationship is over, really over, it is over for good. There are three levels of soul-evolution of the Leos. The highest is represented by the Sphinx; wise beyond their years and great teachers to others. The second is the Lion, King of the Jungle, ruled by ego but always protective and sustaining of those they love. The last is the Lion Cub, immature and undeveloped, frightened by anything new. These Leos cling to others (in the mode of the child not wanting to leave its mother's side).) They can't bear to be alone No matter what level they have attained, all Leos are trendsetters, leaders and adventurers. Their weakness is their pride. This is one sign where the saying 'flattery will get you everything' applies, but be warned criticism will slam the relationship door right in your face."
    },

    {
      "zodiacName":"virgo",
      "zodiacNumber":6,
      "element":"Earth",
      "symbol":"The Virgin",
      "description": "Virgos are often put down badly by many astrologers and written up as being fussy and narrow-minded. But when a Virgo shines, there is practically no sign to match their inner light. An in-tune Virgo is a treat to meet. When a Virgo is confident within themselves they are the most successful, structured and creative of all the signs. Many Virgos can be found working in the 'service to others' industries, ranging from welfare work, doctors, school-teachers through to practising natural forms of healing like massage, herbal remedies etc. One of the most magical characteristics of the Virgo is no matter how many times life or romance turns sour on them, they still manage to maintain faith in others, refusing to become cynical. There is ingenuity around this sign, a kind-heartedness, which unfortunately is sometimes played upon by others for their advantage. Virgos can often become victims of relationship power-games, where they are mistreated. Creative and sensitive, Virgos are delicate people who, like rare and special orchids, require individual treatment to fully blossom into their true unique beauty. Shy, they are happy to allow others to take centre-stage and often generate their time and energy into making those they love happy or successful. Virgos are givers and when the chips are down and you need a friend, the one available during those testing times when you need advice or companionship the most, is likely to be a Virgo. Virgos understand human frailties better than most, because they are so deep and reflective themselves. With a Virgo in your life you have someone who understands and cares and any romance or friendship based upon these qualities is certain to be mutually rewarding."
    },

    {
      "zodiacName":"libra",
      "zodiacNumber":7,
      "element":"Air",
      "symbol":"The Scales",
      "description": "Every adolescent Libran's fantasy is to find the Prince or Princess of their dreams. As their lives unfold, the experiences, false starts, dramas, broken hearts and disillusionment they encounter seeking this personal Holy Grail, often shapes their futures in the most extra-ordinary manner. Love and love-lost makes a big difference to the Libran although their often happy-go-lucky appearance against all kinds of odds may not reveal this as fact. Librans can switch off from the world around then and during these periods much more occurs on the deep innermost levels of the Libran's psyche, than their closest companions imagine. Many Librans after establishing a lifestyle that somehow falls short of their childhood dreams, manage to conjure up a most independent life and keep up an image of being dedicated to a 'close relationship'. They can escape into obscure role playing - and often this makes them extremely successful business people. When it comes to romance and love, Librans can be difficult to fathom yet in business many Librans discover they can not only be creative, but it provides an opportunity to express the more diverse sides to their personalities. Their charm can win jobs and provides powerful friends. But in both work and play, looking for peace and harmony, Librans often say 'yes' when they should be saying 'no'. It is a sad fact about many a Libran's personal or business lives to say - many would have faired far better had they remained alone! But for those Librans who do find their secret dream and meet up with their Prince or Princess, that's another story! You'll find them living in some exotic, distant beautiful place, probably running the local bar or restaurant, designing the beach or ski gear, looking wonderful, sipping cocktails and finding life to be the total paradise they knew it could be. What Librans always have to remember when looking to fulfil their dreams is they should never undermine their own integrity and hold out until their dreams do come true - not simply take whatever is offered."
    },

    {
      "zodiacName":"scorpio",
      "zodiacNumber":8,
      "element":"Water",
      "symbol":"The Scorpion",
      "description": "Reputed to be the 'most powerful' sign of the zodiac, Scorpios lead fate filled lives and have intense and dramatic personal relationships. Even as children Scorpios are often found to be wise beyond their years. Many astrologers call this the sign of the 'oldest souls'. Old and wise beyond the average, Scorpios often know all the answers, except sometimes; they too often have difficulty finding what they need to develop their own happiness. Passion, desire and power go hand in hand for Scorpios. Their biggest challenge and test in life is choosing between the power of love and the love of power. Coming to grips with their extraordinary emotional depths and sensitivity isn't easy for those around them. They are different from all other zodiac signs and this difference has them walking, working and loving to a different beat. Others can often live with a Scorpio partner for years, but not really know them. Much to do with a Scorpio remains ever secret. Their eyes often blaze with feelings that words never express, and beware on the days or nights they hide their feelings behind dark glasses, there is likely to be a storm of some kind brewing. When you deal with a Scorpio you have to always deal with them on a psychic intuitive level. They often wear a mask. Too often they say 'no' when they really mean 'yes'. They have contrary natures. Once they find true love they can be the most faithful dedicated of all partners but fall out badly with a Scorpio and you are likely to find they will never forget or forgive. Most Scorpios are winners. The main thing they have to worry about is their attitudes, which make up their mind powers and can either make or break them. When they are negative about something or someone, or critical of themselves, they can tend to get in their own way. Scorpios operate on three levels of soul evolvement; adding up to three distinctively different types of Scorpios. The first level is the Scorpion. This is the least evolved and most drawn toward using their powers the wrong way. The criminal element of Scorpio comes under this level. Then there is the eagle - the highflying, entrepreneurial, successful Scorpio, who seems able to rise above adversity and transform bad-times into good. Then the highest expression of this sign is the Phoenix Resurrected. These Scorpios are detached and extremely powerful. They are wise beyond their years and act as leaders and are an inspiration to others. Quite frequently a Scorpio goes through the three levels of evolvement in one lifetime - but the levels can operate out of sequence."
    },

    {
      "zodiacName":"sagittarius",
      "zodiacNumber":9,
      "element":"Fire",
      "symbol":"The Archer",
      "description": "Ruled by the benefic planet Jupiter, Sagittarians possess a natural exuberance, sense of adventure and love of life that makes them one of the most optimistic zodiac signs of all. Like their astrological symbol - the Archer - Sagittarians are renowned for aiming their sights towards whatever it is they find alluring - a love partner, dream job, vacation - and making it their own. They believe that anything is possible - and because of this belief system, Sagittarians are adept at seeking out their very own pot of gold at the end of the rainbow. But sometimes trying to tie down these free-spirited individuals is frustrating for those around them. Sagittarians are happiest on the move - exploring new cultures and ideas and many are attracted to occupations related to travel, the media, outdoor work and philosophical pursuits. In love, their catch-cry is 'don't fence me in'. But once they find a partner who understands their need to retain their own sense of self and identity, Sagittarians can be the most big-hearted, generous and fun-loving companions of all. Freedom loving, optimistic and honest, Sagittarians are ruled by Jupiter, the planet of abundance and higher learning. The wisdom of Jupiter imbibes Sagittarians with an inherent need to develop their own unique philosophy of life. The Centaur is their astrological symbol, and it gives many insights into the Sagittarian personality. The higher-evolved Sagittarian learns to integrate the two ends of the Centaur (half-human, half-beast) in order for their arrow (another Sagittarian symbol) of higher aspirations to be more on the mark. Although they are intellectually and spiritually advanced, Sagittarians are notorious for their lack of tact. In relationships they demand independence, but when in love, it can't be denied that they are one of the most big-hearted signs of the zodiac."
    },

    {
      "zodiacName":"capricorn",
      "zodiacNumber":10,
      "element":"Earth",
      "symbol":"The Goat",
      "description": "The sign of the high roller, Capricorn is regarded as the zodiac's top, but also quiet, life and business achievers. But, there are two very different types of Capricorns. The first is represented by the mountain goat, always climbing higher and higher; never content until reaching the top. The second is the garden goat, with little adventurous spirit or ambition-happy to remain within a small domain, refusing to budge unless it is pushed. Either type of Capricorn, however, is patient and persevering. They reach their goals because they know the longest journey commences with a single step and that the first step is always the most difficult. The one thing a Capricorn must always try to do is balance work with play; otherwise they can become too one-sided and work can replace true personal emotional fulfilment. Continually climbing the eternal mountain of success, Capricornians rise to the occasion when faced with a new task or deadline. Even if something comes to a grinding halt, their ambition to reach the ultimate keeps them moving forever onwards and upwards (prompted by the strict influence of ruling planet Saturn). Although conservative and cautious, Goats are willing to try unusual approaches on their road to success in business or in love. Romantically, they desire a permanent relationship with someone who'll give them the affection they crave (and often neglect to give themselves!) The rulership of Saturn - the planet representing responsibility, structure and hard work - ensures that Capricorns in their truest of expression, are ambitious, practical and superb organizers. Although many Capricorns are borderline workaholics, this doesn't necessarily make them dull or gloomy! They have an offbeat sense of humour, which seems to erupt at the most unexpected moments. Their motivating force in life is success, money, status, authority and - although many might not admit it - love. By nature Capricorns are cautious when entering a new love relationship, but once they feel 'safe' with their partner, the cool exterior melts away to reveal a sensitive and loyal heart beneath. As a friend, Capricorns can be relied upon to provide the strongest and most sympathetic pair of shoulders in the zodiac..."
    },

    {
      "zodiacName":"aquarius",
      "zodiacNumber":11,
      "element":"Air",
      "symbol":"The Water Bearer",
      "description": "Special note for Aquarians: With the new Millennium heralding the Dawn of the Age of Aquarius, at this time, ready or not, your sign is regarded as the zodiac's leader. You are the trendsetter for the future and because of this high responsibility, many under born your sign will be undergoing at this time, as we approach the Millennium, the pressure of personal change (particularly in your values and what makes you content and happy). Yours has always been a philanthropic sign. Now more than ever these qualities will be highlighted. Those born under the sign of Aquarius not only march to a different drummer, they make up new music as they go along. They are 'mind oriented' individuals, whose thoughts never stop tick-tocking over. Because of their high focus on intellectual exploration, many inventors, eccentrics and highly original trailblazers are born under this sign. Their intense ability to live on many mental levels, holds both pain and pleasure for Aquarians. For example, in the American Hall of Fame there are more Aquarians than any other sign, yet statistics reveal that in mental institutions there are more Aquarians than any other sign too. Many extremes can surround this sign and these extremes can take them to both heaven and hell. But in everyday terms, most Aquarians are extremely humanitarian and often involved in social programs that assist others. They can also be objective in judgement, for they never let their emotions get in the way. Outgoing and amiable, Aquarians attract friends wherever they go and those whom Aquarians befriend have their unswerving loyalty. Aquarians are the zodiac's most mysterious and unusual people - and no two are anything alike. Those born under this sign - ruled by innovative and non-conformist Uranus - march to the beat of their own drum. They see life in a different way. Others quite frequently think their habits and ideas are eccentric or crazy in some way, but it is this uniqueness that makes them so special. The Aquarian mind is extremely quick and they never seem to stop thinking (it is interesting to note that many born under this sign suffer from insomnia.) Aquarians usually have strong political, environmental or social beliefs. But whether it is a relationship, career or cause - Aquarians are happiest when they have 'something' to believe in and nurture."
    },

    {
      "zodiacName":"pisces",
      "zodiacNumber":12,
      "element":"Water",
      "symbol":"The Fish",
      "description": "Mysterious and alluring individuals, most Pisces are extremely talented, but even though they are gifted in many ways, they still manage to spend most of their lives battling 'confusing' conditions. Pisces is the sign symbolised by the image of two fish. Their symbol depicts one fish heading upward, the other pulling downward. This mirrors how Pisceans are frequently torn between two pathways in life, or actually do live two very different existences at the same time. The number 2, is a very powerful number for them. This zodiac sign is acknowledged as being the Saint and the Sinner rolled into one; the trendsetter of fashion or art, the lost soul, the philosopher and the psychotic and the visionary. As a credit to them, considering their many vulnerable characteristics; Pisceans are incredibly adaptable and resilient. They are to be found leading the field in many diverse areas of life and many Pisces can be found represented amongst top business millionaires. On the other side of the coin, prisons, reform schools and all kinds of institutions statistically hold a high number of Pisceans too. The Piscean's inner quest to explore their 'ivory tower' syndrome can lead them into some most unusual and unlikely living conditions. Of all the signs of the zodiac, Pisces are the ones who end up in the most muddles over the years of their lives. They fantasize about situations, people and particularly romance - and because they spend so much time in their own form of 'fantasy land' this can catch them short in other more worldly areas. Because of this inner world of fantasy, Pisces people seldom perceive whatever is going on around them in its true light. They see life instead as they want to see it, coloring their view of the world in hues and tones far removed from its true reflection. No wonder this is the sign of both miracles and disillusionment. If you are a Pisces, be warned your emotions are a weak spot. One thing that plays havoc with your life is romance. When things romantically are going well for you, you are on cloud nine. When romance turns sour you land in a heap. Pisces often need to take lots of holidays (or time off) to recover from life's many diverse pressures. You are the zodiac's most sensitive sign, so you need to take extra special care of yourself. Nobody can beat you up, as much as you can beat yourself up within your own mind. In your purest form you are psychic, visionary and a guiding light to all who know you. But, in your 'out of tune' state, you become depressed, obsessive and confused."
    }
  ]
}